# Problem Statement 1:

1) How-to-count-distance-to-the-previous-zero
For each value, count the difference of the distance from the previous zero (or the start of the Series, whichever is closer) and if there are no previous zeros, print the position

Consider a DataFrame df where there is an integer column {'X'[7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}

The values should therefore be [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]. Make this a new column 'Y'.
import pandas as pd
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

In [1]:
import pandas as pd

df = pd.DataFrame({"X": [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
Y, index = [], 0

for i in range(len(df.X)):
    if df.X[i] == 0:
        index = 0
    else:
        index += 1
    Y.append(index)

df["Y"] = Y
print("count-distance-to-the-previous-zero")
df

count-distance-to-the-previous-zero

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

2) Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers.

In [2]:
import numpy as np

dates = pd.date_range(start="2015-01-01", end="2015-12-31", freq="B") 
s = pd.Series(np.random.rand(len(dates)), index=dates)
s

2015-01-01    0.087410
2015-01-02    0.445303
2015-01-05    0.166941
2015-01-06    0.418884
2015-01-07    0.937914
2015-01-08    0.627372
2015-01-09    0.776114
2015-01-12    0.203518
2015-01-13    0.683256
2015-01-14    0.564690
2015-01-15    0.213692
2015-01-16    0.283347
2015-01-19    0.680931
2015-01-20    0.559348
2015-01-21    0.479486
2015-01-22    0.436974
2015-01-23    0.623640
2015-01-26    0.336771
2015-01-27    0.492855
2015-01-28    0.902252
2015-01-29    0.570326
2015-01-30    0.984744
2015-02-02    0.057861
2015-02-03    0.586980
2015-02-04    0.528294
2015-02-05    0.142855
2015-02-06    0.487019
2015-02-09    0.394975
2015-02-10    0.241141
2015-02-11    0.211280
                ...
2015-11-20    0.321970
2015-11-23    0.417773
2015-11-24    0.122544
2015-11-25    0.703211
2015-11-26    0.120443
2015-11-27    0.374746
2015-11-30    0.348356
2015-12-01    0.217075
2015-12-02    0.237454
2015-12-03    0.409151
2015-12-04    0.825671
2015-12-07    0.080896
2015-12-08    0.783313
2015-12-09    0.332492
2015-12-10    0.992672
2015-12-11    0.942451
2015-12-14    0.704979
2015-12-15    0.224346
2015-12-16    0.878075
2015-12-17    0.480211
2015-12-18    0.613945
2015-12-21    0.448559
2015-12-22    0.476733
2015-12-23    0.643850
2015-12-24    0.389770
2015-12-25    0.820820
2015-12-28    0.134319
2015-12-29    0.429969
2015-12-30    0.908928
2015-12-31    0.026177
Freq: B, Length: 261, dtype: float64

3) Find the sum of the values in s for every Wednesday

In [3]:
s[dates.weekday == 2].sum()

27.474002579620485

4) Average For each calendar month

In [4]:
s.resample("M").mean()

2015-01-31    0.521626
2015-02-28    0.425111
2015-03-31    0.467907
2015-04-30    0.509850
2015-05-31    0.467616
2015-06-30    0.513264
2015-07-31    0.486229
2015-08-31    0.649272
2015-09-30    0.468868
2015-10-31    0.498383
2015-11-30    0.390258
2015-12-31    0.521820
Freq: M, dtype: float64

5) For each group of four consecutive calendar months in s, find the date on which the highest value occurred.

In [5]:
print("Jan-Apr = ", s["2015-01-01":"2015-04-30"].idxmax())
print("May-Aug = ", s["2015-05-01":"2015-08-31"].idxmax())
print("Sep-Dec = ", s["2015-09-01":"2015-12-31"].idxmax())

Jan-Apr =  2015-01-30 00:00:00
May-Aug =  2015-06-17 00:00:00
Sep-Dec =  2015-12-10 00:00:00

# Problem Statement 2:

Read the dataset from the below link
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv

In [6]:
import pandas as pd
import numpy as np

df = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")
df.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

1) Delete unnamed columns

In [7]:
df.drop("Unnamed: 0", axis=1, inplace=True)
df.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

2) Show the distribution of male and female

In [8]:
print(df.groupby("Gender").count())
print()
print(df["Gender"].value_counts("F"))

            Id    Name    Year   State   Count
Gender
F       558846  558846  558846  558846  558846
M       457549  457549  457549  457549  457549

F    0.549832
M    0.450168
Name: Gender, dtype: float64

3) Show the top 5 most preferred names

In [9]:
df["Name"].value_counts().head()

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

4) What is the median name occurrence in the dataset

In [10]:
data_median =  (np.where(df["Id"] == df["Id"].median()))
df.loc[data_median]

             Id   Name  Year Gender State  Count
508197  2811921  Kasey  2010      F    MO      6

5) Distribution of male and female born count by states

In [11]:
df.groupby(["State", "Gender"]).count()["Count"]

State  Gender
AK     F          2404
       M          2587
AL     F          9878
       M          8419
AR     F          7171
       M          6475
AZ     F         14518
       M         10820
CA     F         45144
       M         31637
CO     F         11424
       M          9183
CT     F          6575
       M          5733
DC     F          3053
       M          3000
DE     F          2549
       M          2440
FL     F         25781
       M         20070
GA     F         19385
       M         15454
HI     F          3255
       M          3546
IA     F          7131
       M          6307
ID     F          4918
       M          4833
IL     F         21268
       M         16828
                 ...
OK     F          9519
       M          8138
OR     F          8604
       M          7333
PA     F         17480
       M         14171
RI     F          2558
       M          2468
SC     F          9465
       M          8195
SD     F          2838
       M          2908
TN     F         13063
       M         10588
TX     F         39760
       M         27791
UT     F          9515
       M          8233
VA     F         14759
       M         11997
VT     F          1398
       M          1618
WA     F         13329
       M         11049
WI     F         10549
       M          8940
WV     F          4305
       M          3733
WY     F          1456
       M          1904
Name: Count, Length: 102, dtype: int64